brew "ansible"
brew "bash"
brew "git"
brew "git-extras"
brew "htop-osx"
brew "hub"
brew "lesspipe"
brew "nmap"
brew "ssh-copy-id"
brew "tree"
brew "wget"
brew "bash-completion"
brew "cmake"
brew "curl"
brew "nvm"
brew "postgresql"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
brew "poetry"

brew "shellcheck"
# Command-line interface for SQLite
brew "sqlite"
# Command-line interface for github
brew "gh"
# Command-line interface for gitlab
brew "glab"
# Install various Ruby versions and implementations
brew "ruby-build"
brew "rbenv"
brew "jq"
brew "yq"
brew "k9s"
brew "kubernetes-cli"
brew "helm"
brew "helmfile"
brew "openshift-cli"
brew "mtr"
brew "ncurses"
brew "fish"
# Cross-shell prompt for astronauts
brew "starship"
brew "mas"
# Open source programming language to build simple/reliable/efficient software
brew "go"
brew "sops"
brew "age"
brew "go-task"
brew "php"
brew "composer"

brew "node"
brew "npm"
brew "pnpm"


# Command-line interface for 1Password
cask "1password-cli"

cask "caffeine"
cask "diffmerge"

vscode "docker.docker"
vscode "adamhartford.vscode-base64"
vscode "alefragnani.project-manager"
vscode "ameenahsanma.poetry-monorepo"
vscode "atlassian.atlascode"
vscode "balazs4.gitlab-pipeline-monitor"
vscode "bmewburn.vscode-intelephense-client"
vscode "bradlc.vscode-tailwindcss"
vscode "cweijan.dbclient-jdbc"
vscode "cweijan.vscode-mysql-client2"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "figma.figma-vscode-extension"
vscode "formulahendry.docker-explorer"
vscode "genieai.chatgpt-vscode"
vscode "george-alisson.html-preview-vscode"
vscode "github.vscode-pull-request-github"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "harryhopkinson.vs-code-runner"
vscode "hbenl.vscode-test-explorer"
vscode "heissenbergerlab.php-array-from-json"
vscode "humao.rest-client"
vscode "janisdd.vscode-edit-csv"
vscode "jinxcappa.sopsie"
vscode "karyan40024.gotmpl-syntax-highlighter"
vscode "kevinrose.vsc-python-indent"
vscode "kuscamara.electron"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "markis.code-coverage"
vscode "mblode.pretty-formatter"
vscode "mechatroner.rainbow-csv"
vscode "mhutchie.git-graph"
vscode "miragon-gmbh.vs-code-bpmn-modeler"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpp-devtools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "openai.chatgpt"
vscode "redhat.vscode-xml"
vscode "redhat.vscode-yaml"
vscode "sanderronde.vscode--gerrit"
vscode "searking.preview-vscode"
vscode "shopify.ruby-lsp"
vscode "sissel.shopify-liquid"
vscode "tim-koehler.helm-intellisense"
vscode "tomoki1207.pdf"
vscode "twxs.cmake"